; domain
(define (domain minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :conditional-effects :existential-preconditions :constraints :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem minigrid-problem)
 (:domain minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   green_door_1 red_door_1 purple_door_1 blue_door_1 - door
   green_box_2 grey_box_1 yellow_box_2 green_box_1 yellow_box_1 - box
   blue_ball_1 blue_ball_2 yellow_ball_1 - ball
 )
 (:init (agentinroom room_2) (objectinroom yellow_box_1 room_1) (objectinroom green_box_1 room_2) (objectinroom yellow_ball_1 room_2) (objectinroom blue_ball_1 room_2) (objectinroom grey_box_1 room_3) (objectinroom blue_ball_2 room_3) (objectinroom green_box_2 room_4) (objectinroom yellow_box_2 room_4) (objectcolor yellow_box_1 yellowtype) (objectcolor green_box_1 greentype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_ball_1 bluetype) (objectcolor grey_box_1 greytype) (objectcolor blue_ball_2 bluetype) (objectcolor green_box_2 greentype) (objectcolor yellow_box_2 yellowtype) (objectcolor green_door_1 greentype) (objectcolor red_door_1 redtype) (objectcolor purple_door_1 purpletype) (objectcolor blue_door_1 bluetype) (emptyhands) (locked green_door_1) (locked red_door_1) (locked purple_door_1) (locked blue_door_1) (adjacentrooms room_2 room_1 green_door_1) (adjacentrooms room_1 room_2 green_door_1) (adjacentrooms room_3 room_1 red_door_1) (adjacentrooms room_1 room_3 red_door_1) (adjacentrooms room_4 room_2 purple_door_1) (adjacentrooms room_2 room_4 purple_door_1) (adjacentrooms room_4 room_3 blue_door_1) (adjacentrooms room_3 room_4 blue_door_1) (visited room_2) (= (total-cost) 0))
 (:goal (and (exists (?v - box)
 (and (objectcolor ?v greytype) (objectinroom ?v room_3) (agentinroom room_3) (at_ ?v)))))
 (:constraints (sometime (or (not (locked purple_door_1)) (at_ purple_door_1))) (sometime (and (not (emptyhands)) (carrying yellow_box_1))) (sometime (at_ blue_ball_1)) (sometime (locked red_door_1)) (sometime-after (locked red_door_1) (not (emptyhands))) (sometime (agentinroom room_1)) (sometime-before (agentinroom room_1) (and (carrying yellow_ball_1) (at_ yellow_box_2))) (sometime (not (locked red_door_1))) (sometime-before (not (locked red_door_1)) (and (agentinroom room_4) (objectinroom green_box_1 room_4))) (sometime (agentinroom room_2)) (sometime-after (agentinroom room_2) (not (locked blue_door_1))))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor purple_door_1 room_2 room_4)
   added: (at_ purple_door_1)
   goals met: 0 of 1
2. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 0 of 1
3. (gotoobject green_box_1 room_2)
   deleted: (at_ purple_door_1)
   added: (at_ green_box_1)
   goals met: 0 of 1
4. (pick green_box_1 room_2)
   deleted: (at_ green_box_1) (emptyhands) (objectinroom green_box_1 room_2)
   added: (carrying green_box_1)
   goals met: 0 of 1
5. (gotoroom room_2 room_4 purple_door_1)
   deleted: (agentinroom room_2)
   added: (agentinroom room_4) (visited room_4)
   goals met: 0 of 1
6. (gotodoor blue_door_1 room_4 room_3)
   added: (at_ blue_door_1)
   goals met: 0 of 1
7. (toggle blue_door_1)
   deleted: (locked blue_door_1)
   goals met: 0 of 1
8. (gotoempty)
   deleted: (at_ blue_door_1)
   added: (at_ empty)
   goals met: 0 of 1
9. (drop green_box_1 room_4)
   deleted: (carrying green_box_1) (at_ empty)
   added: (at_ green_box_1) (emptyhands) (objectinroom green_box_1 room_4)
   goals met: 0 of 1
10. (gotoroom room_4 room_2 purple_door_1)
   deleted: (agentinroom room_4) (at_ green_box_1)
   added: (agentinroom room_2)
   goals met: 0 of 1
11. (gotoobject yellow_ball_1 room_2)
   added: (at_ yellow_ball_1)
   goals met: 0 of 1
12. (pick yellow_ball_1 room_2)
   deleted: (at_ yellow_ball_1) (emptyhands) (objectinroom yellow_ball_1 room_2)
   added: (carrying yellow_ball_1)
   goals met: 0 of 1
13. (gotoobject blue_ball_1 room_2)
   added: (at_ blue_ball_1)
   goals met: 0 of 1
14. (gotoroom room_2 room_4 purple_door_1)
   deleted: (agentinroom room_2) (at_ blue_ball_1)
   added: (agentinroom room_4)
   goals met: 0 of 1
15. (gotoobject yellow_box_2 room_4)
   added: (at_ yellow_box_2)
   goals met: 0 of 1
16. (gotoroom room_4 room_3 blue_door_1)
   deleted: (agentinroom room_4) (at_ yellow_box_2)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 1
17. (gotodoor red_door_1 room_3 room_1)
   added: (at_ red_door_1)
   goals met: 0 of 1
18. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 0 of 1
19. (gotoroom room_3 room_1 red_door_1)
   deleted: (agentinroom room_3) (at_ red_door_1)
   added: (agentinroom room_1) (visited room_1)
   goals met: 0 of 1
20. (gotoempty)
   added: (at_ empty)
   goals met: 0 of 1
21. (drop yellow_ball_1 room_1)
   deleted: (carrying yellow_ball_1) (at_ empty)
   added: (at_ yellow_ball_1) (emptyhands) (objectinroom yellow_ball_1 room_1)
   goals met: 0 of 1
22. (gotoobject yellow_box_1 room_1)
   deleted: (at_ yellow_ball_1)
   added: (at_ yellow_box_1)
   goals met: 0 of 1
23. (pick yellow_box_1 room_1)
   deleted: (at_ yellow_box_1) (emptyhands) (objectinroom yellow_box_1 room_1)
   added: (carrying yellow_box_1)
   goals met: 0 of 1
24. (gotoroom room_1 room_3 red_door_1)
   deleted: (agentinroom room_1)
   added: (agentinroom room_3)
   goals met: 0 of 1
25. (gotoobject grey_box_1 room_3)
   added: (at_ grey_box_1)
   goals met: 1 of 1
